
# 2023.04.08-春招-第三题-构造排列
# 题目内容

# 塔子哥是一个学生，他最近学习的时候遇到了一个题目，题目给定了一个长度为 nn 的排列吗，题目要求将这个排列的前 kk 个数排列成一个长度为 kk 的排列，但是题目规定只能进行相邻两个数的交换操作，题目问最少需要多少次上述操作才能满足题目要求？

# 塔子哥思考了很久还是不会，他现在想请教你，想让你帮忙解决一下这个问题。

# 长度为 nn 的排列指 11 到 nn 中每个数都恰好出现 11 次。例如 [2,3,1][2,3,1] 是排列， [2,3,4][2,3,4] 则不是排列。
# 输入描述

# 第一行输入两个正整数 nn 和 kk 。

# 第二行输入 nn 个正整数 aiai​ ，代表塔子哥拿到的排列。

# 1≤k≤n≤2000001≤k≤n≤200000

# 1≤ai≤n1≤ai​≤n
# 输出描述

# 一个整数，代表最小的操作次数。
# 样例

# 输入

# 5 3
# 2 4 1 3 5

# 输出

# 2

# 样例解释

# 第一次交换 44 和 11 ，数组变成 [2,1,4,3,5][2,1,4,3,5] 。

# 第二次交换 44 和 33 ，数组变成 [2,1,3,4,5][2,1,3,4,5] 。

# 此时前 33 个数构成排列，满足条件。

n,k=list(map(int,input().split()))
arr=list(map(int,input().split()))
l,r=0,0
for i, a in enumerate(arr,start=1):
    if i <= k and a > k:
        l += i  
    if i > k and a <= k:
        r += i  
print(r-l)