
// 2023.3.12-飞机大战
// 题目内容

// 塔子哥是一个游戏迷，最近沉迷于一款飞机大战游戏中。在这个游戏中，他需要控制一架飞机发射子弹，来消灭出现在屏幕中的敌人。为了让游戏更加有趣和挑战性，游戏设置了两种不同的发射按键，每个按键都有不同的特殊效果。

// 在游戏中，按下 AA 键，飞机会发射出 22 枚子弹，每个子弹会对命中的敌人造成 11 点固定伤害，但不能作用于同一个敌人。而按下 BB 键，飞机会发射出 11 枚子弹，该子弹能够对命中的敌人造成巨额伤害并瞬间将其秒杀。

// 整个游戏一共有 TT 个关卡，每个关卡会在屏幕中同时出现 NN 个敌人，这 NN 个敌人所能承受的伤害也已经确定。当塔子哥消灭当前关卡的所有敌人后，发射出去多余的子弹会消失，游戏会自动进入下一个关卡。

// 作为一名游戏高手，塔子哥总是能够操纵子弹命中想要攻击的敌人。但是，他还是很好奇每个关卡自己最少需要按几次发射按键才能将所有敌人全部消灭。他找到了你，希望你能够帮助他解决这个问题。
// 输入描述

// 第一行输入一个固定数字 TT （ 1≤T≤10001≤T≤1000 ）表示关卡的总数量， NN （ 1≤N≤2001≤N≤200 ）表示每个关卡出现的敌人数量。

// 接下来 TT 行，每行有 NN 个数字 D1，D2，.....,DND1​，D2​，.....,DN​ （ 1≤Di≤2001≤Di​≤200 ）分别表示这 NN 个敌人所能承受的伤害。
// 输出描述

// 结果共有 NN 行，每行一个数字，分别表示对于这个关卡，最少按几次发射按键就可以将敌人全部消灭。
// 样例

// 输入

// 3 3
// 1 2 1
// 2 3 2
// 1 2 3

// 输出

// 2
// 3
// 3

// 样例解释

// 游戏共有 33 个关卡，每个关卡会出现 33 个敌人。

// 第一个关卡，先按下 AA 键控制子弹消灭第 11 个和第 33 个敌人后，再按下 BB 键消灭第二个敌人。所以最少按 22 次。

// 第二个关卡，按下 33 次 BB 键分别消灭这 33 个敌人。

// 第三个关卡，按下 33 次 BB 键分别消灭这 33 个敌人。也可以按 33 次 AA 键，敌人剩余承受伤害的变化为： [1, 2, 3] ->[1，1，2]->[1,0,1]->[0，0，0]

#include<bits/stdc++.h>
using namespace std;

int main() {
    int t,n;
    cin >> t >> n;
    vector<int> arr(n);
    while (t--) {
        for (int i = 0; i < n; i++) cin >> arr[i];
        sort(arr.begin(), arr.end());
        int ans = 0;
        for (int i = 0; i < n; i++) {
            if (arr[i] == 0) continue;
            if (arr[i] == 1) {
                if (i+1 < n) arr[i+1]--;
            }
            ans++;
        }
        cout << ans << endl;
    }
    return 0;
}